# Warm-up

At times, you might need to generate random data for testing purposes. This can be done with Numpy's `random.rand`, which creates arrays of specified shapes and fill.

Below, randomly generate an array of dimensions (8,2).

array([[ 1.42540865,  0.44093111],
       [-0.29845667,  0.25098409],
       [ 1.17335285, -1.45870964],
       [-0.46495616,  0.32543289],
       [-0.10913081,  0.20378759],
       [-0.58332183,  0.82701948],
       [ 0.58517324,  1.33727442],
       [-0.85944402, -1.38377839]])

Reshape the array to dimensions (4,4)

array([[ 1.42540865,  0.44093111, -0.29845667,  0.25098409],
       [ 1.17335285, -1.45870964, -0.46495616,  0.32543289],
       [-0.10913081,  0.20378759, -0.58332183,  0.82701948],
       [ 0.58517324,  1.33727442, -0.85944402, -1.38377839]])

Below, convert the array to a dataframe and name the columns A,B,C, and D.

          A         B         C         D
0  1.425409  0.440931 -0.298457  0.250984
1  1.173353 -1.458710 -0.464956  0.325433
2 -0.109131  0.203788 -0.583322  0.827019
3  0.585173  1.337274 -0.859444 -1.383778

Change the name of column "A" to "Alpha" in the dataframe you created above.

      Alpha         B         C         D
0  1.425409  0.440931 -0.298457  0.250984
1  1.173353 -1.458710 -0.464956  0.325433
2 -0.109131  0.203788 -0.583322  0.827019
3  0.585173  1.337274 -0.859444 -1.383778

Sort on "Alpha" column in ascending order and reset the index. No new column should be created.

      Alpha         B         C         D
0 -0.109131  0.203788 -0.583322  0.827019
1  0.585173  1.337274 -0.859444 -1.383778
2  1.173353 -1.458710 -0.464956  0.325433
3  1.425409  0.440931 -0.298457  0.250984

Make column "Alpha" the dataframe's new index.

                  B         C         D
Alpha
-0.109131  0.203788 -0.583322  0.827019
 0.585173  1.337274 -0.859444 -1.383778
 1.173353 -1.458710 -0.464956  0.325433
 1.425409  0.440931 -0.298457  0.250984

Select the two first rows of the dataframe.

                  B         C         D
Alpha
-0.109131  0.203788 -0.583322  0.827019
 0.585173  1.337274 -0.859444 -1.383778